app/views/carts/_form.html.erb

SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = 37
---
<%= form_for(@cart) do |f| %>
   <% @cart.line_items.each do |item| %>