app/controllers/carts_controller.rb

  def create
    @cart = Cart.new(params[:id])

    respond_to do |format|
      if @cart.save
---
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Mon, 10 Dec 2012 18:20:08 UTC +00:00], ["updated_at", Mon, 10 Dec 2012 18:20:08 UTC +00:00]]