app/controllers/line_items_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "21"]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Mon, 10 Dec 2012 18:52:26 UTC +00:00], ["updated_at", Mon, 10 Dec 2012 18:52:26 UTC +00:00]]
INSERT INTO "line_items" ("cart_id", "created_at", "product_id", "quantity", "updated_at") VALUES (?, ?, ?, ?, ?)  [["cart_id", 32], ["created_at", Thu, 13 Dec 2012 04:25:06 UTC +00:00], ["product_id", 21], ["quantity", nil], ["updated_at", Thu, 13 Dec 2012 04:25:06 UTC +00:00]]
---
  def create
    @cart = current_cart
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(params[:product_id])

    puts @line_item
    sleep 15
    # @line_item = @cart.line_items.build(product_id: product.id)
    # @line_item = LineItem.new(params[:line_item])

    respond_to do |format|
      if @line_item.save