app/controllers/products_controller.rb

  def index
    if params[:prodtype].blank?
      @products = Product.all
  else
      @products = Product.where(:ProdType => params[:prodtype])
---
SELECT "products".* FROM "products"
SELECT "products".* FROM "products" WHERE "products"."ProdType" = 'Recycled Art'

  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("ProdType", "created_at", "prod_desc", "prod_img", "prod_name", "prod_price", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "4"]]
UPDATE "products" SET "prod_name" = 'Picture2 - Wave', "updated_at" = '2012-12-05 18:57:23.885509' WHERE "products"."id" = 2