app/controllers/store_controller.rb

SELECT "products".* FROM "products" ORDER BY prod_name
---
  def index
  	@products = Product.order(:prod_name)